//*****************************************************************************
/// @file
/// ハードウェアのセットアップを行うファイル
//*****************************************************************************

//=============================================================================
// includeファイル
//=============================================================================
#include "hardwaresetup.h"
#include <machine.h>
#include "iodefine.h"
#include <stdio.h>
//=============================================================================
// マクロ定義(定数, 関数マクロ)
//=============================================================================

//=============================================================================
// 型定義(typedef, 構造体等)
//=============================================================================

//=============================================================================
// 内部関数のプロトタイプ宣言
//=============================================================================

//=============================================================================
// 内部変数・内部定数定義
//=============================================================================

//=============================================================================
// 外部変数・外部定数定義
//=============================================================================

//=============================================================================
//  内部関数
//=============================================================================

//*****************************************************************************
/// 関数の説明を記述する。
/// 
/// 内部関数は以下を除き外部関数の定義と同様
/// - 一文字目を小文字にする
/// - static定義する。
//*****************************************************************************

//=============================================================================
//  外部関数
//=============================================================================

//*****************************************************************************
/// ハードウェアセットアップ関数
///
//*****************************************************************************
void HardwareSetup( void )
{
	SYSTEM.PRCR.WORD		= 0x0A50F;				//クロックソース選択の保護解除
	SYSTEM.SCKCR3.BIT.CKSEL	= 1;					//HOCOを使用する
	SYSTEM.HOCOCR2.BYTE		= 0xFF;					//50MHzに設定する
	SYSTEM.HOCOCR.BIT.HCSTP	= 0;					//HOCO動作開始
	SYSTEM.SCKCR.BIT.ICK	= 0;					//ICLKは分周なし
	SYSTEM.SCKCR.BIT.PCKB	= 1;					//PCLKBを2分周

}

//*****************************************************************************
/// 電圧検出関数
//  電源電圧が4V以下になったらマイコンを落とす
//*****************************************************************************
void reset_ic( void )
{
	SYSTEM.PRCR.BIT.PRC3			= 1;				//LVD関連レジスタへの書き込み許可
	SYSTEM.LVD1CR1.BIT.LVD1IDTSEL	= 1;				//VCC<Vdet1(下降)検出時
	SYSTEM.LVDLVLR.BIT.LVD1LVL		= 1;				//Vdetを4Vに設定
	SYSTEM.LVCMPCR.BIT.EXVREFINP1	= 0;				//内部基準電圧にする
	SYSTEM.LVCMPCR.BIT.EXVCCINP1	= 0;				//Vcc電圧を検出する
//	SYSTEM.LVD1CLR.BIT.LVD1FSAMP =0;					//LOCOの分周設定→分周なし
	SYSTEM.LVD1CR0.BIT.LVD1DFDIS	= 1;				//デジタルフィルタ無効
	SYSTEM.LVD1CR0.BIT.LVD1RI		= 1;				//電圧監視１リセットにする
	SYSTEM.LVD1CR0.BIT.LVD1RN		= 0;				//ネゲート
	SYSTEM.LVD1CR0.BIT.LVD1RIE		= 1;				//電圧監視1/コンパレータA1割り込み許可
	SYSTEM.LVCMPCR.BIT.LVD1E		= 1;				//電圧検出1回路有効にする
	SYSTEM.LVD1CR0.BIT.LVD1CMPE		= 1;				//電圧監視１回路比較結果出力許可にする

	SYSTEM.PRCR.BIT.PRC3			= 0;				//LVD関連レジスタへの書き込み禁止
}

//*****************************************************************************
/// CMT1設定関数
//  LEDを一定時間停止状態にするために使用する
//*****************************************************************************
void init_cmt1( void )//25MHzで動作
{
	MSTP(CMT1)			= 0;				// CMTの初期化
	CMT.CMSTR0.BIT.STR1	= 0;				// CMT1カウント停止
	CMT1.CMCR.BIT.CKS	= 0xFF;				// 分周を行う 1/512
	CMT1.CMCR.BIT.CMIE	= 1;				// コンペアマッチ割り込み許可
	CMT1.CMCOR			= 48828-1;			// 1s
	CMT1.CMCNT			= 0;				// コンペアマッチタイマカウンタ
	CMT.CMSTR0.BIT.STR1	= 1;				// CMT1カウントスタート
	
	IPR(CMT1,CMI1)		= 8;				// CMI1の割り込み優先度を設定
	IEN(CMT1,CMI1)		= 1;				// 割り込みを許可する
	IR( CMT1, CMI1 )	= 0;				// CMT0 コンペアマッチ割り込み要求フラグをクリア
}


//*****************************************************************************
/// CMT2設定関数
//  チャタリング除去のために使用する
//*****************************************************************************
void init_cmt2( void )
{
	MSTP(CMT2)			= 0;				// CMTの初期化
	CMT.CMSTR1.BIT.STR2	= 0;				// CMT2カウント停止
	CMT2.CMCR.BIT.CKS	= 0xFF;				// 分周を行う 1/512
	CMT2.CMCR.BIT.CMIE	= 1;				// コンペアマッチ割り込み許可
	CMT2.CMCOR			= 488-1;			// 10ms
	CMT2.CMCNT			= 0;				// コンペアマッチタイマカウンタ
	CMT.CMSTR1.BIT.STR2	= 1;				// CMT2カウントスタート
	
	IPR(CMT2,CMI2)		= 14;				// CMI1の割り込み優先度を設定(高)
	IEN(CMT2,CMI2)		= 1;				// 割り込みを許可する
	IR( CMT2, CMI2 )	= 0;				// CMT2 コンペアマッチ割り込み要求フラグをクリア


	PORTE.PMR.BIT.B2	= 0;				//E2をI/Oポートにする
	PORTE.PDR.BIT.B2	= 0;				// E2入力にする(タクトスイッチに使う)
	PORTE.PCR.BIT.B2	= 1;				// 入力プルアップ抵抗有効
}

//*****************************************************************************
/// MTU3設定関数
//  PWM出力のために使用する
//*****************************************************************************
void init_mtu3( void )//25MHzで動作
{
	MSTP(MTU3)			= 0;		//MTU3を有効にする

	//端子入力機能設定
	PORTC.PMR.BIT.B1	= 0;		//C1をI/Oポートに設定
	MPC.PWPR.BIT.B0WI	= 0;		//PFSWEビットへの書き込みを許可
	MPC.PWPR.BIT.PFSWE	= 1;		//PFSレジスタへの書き込み可
	MPC.PC1PFS.BIT.PSEL	= 0x01;		//ポートCをPWM出力設定
	MPC.PWPR.BIT.B0WI	= 1;		//PFSWEビットへの書き込みを禁止
	MPC.PWPR.BIT.PFSWE	= 0;		//PFSレジスタへの書き込み禁止
	PORTC.PMR.BIT.B1 	= 1;		//C1を周辺機能ポートにする

	//PWMモード設定
	MTU.TSTR.BIT.CST3	= 0;		//MTU3のカウントを止める
	//[1]
	MTU3.TCR.BIT.TPSC	= 0x003;	//分周なし
	MTU3.TCR.BIT.CKEG	= 0;		//立ち上がりエッジでカウント
	//[2]
	MTU3.TCR.BIT.CCLR	= 2;		//TGRBのコンペアマッチでTCNTをクリア
	//[3]
	MTU3.TMDR.BIT.MD	= 0x02;		//タイマの動作モードでPWMモード１を設定
	MTU3.TMDR.BIT.BFA	= 1;		//TGRAとTGRCをバッファ動作
	MTU3.TMDR.BIT.BFB	= 0;		//TGRBとTGRDをバッファ動作
	//[4]
	MTU3.TIORH.BIT.IOA	= 0x02;		//初期出力LOW,出力値LOW
	MTU3.TIORH.BIT.IOB	= 0x05;		//出力値HIGH
	MTU3.TBTM.BIT.TTSA	= 1;		//TGRCからTGRAへの転送タイミングは各チャンネルのコンペアマッチB発生時
	//[5]
	MTU3.TGRA			= 3300;		//デューティ比
	MTU3.TGRB			= 3900;		//周期 100Hz
	//[6]
	MTU3.TCNT			= 0;		//カウント初期化

	IPR(MTU3,TGIA3)		= 7;		//TGIA0の割り込み優先度を7に設定
	IPR(MTU3,TGIB3)		= 7;		//TGIB0の割り込み優先度を7に設定
	IR(MTU3,TGIA3)		= 0;		//TGIA0の割り込みフラグを設定
	IR(MTU3,TGIB3)		= 0;		//TGIB0の割り込みフラグを設定
	IEN(MTU3,TGIA3)		= 1;
	IEN(MTU3,TGIB3)		= 1;
	
	MTU.TSTR.BIT.CST3	= 1;		//MTU3のカウントを始める

}

//*****************************************************************************
/// 独立ウォッチドッグタイマ設定関数
//*****************************************************************************

void iwdt( void ){
	IWDT.IWDTCR.BIT.TOPS		= 0;		//クロック期間1024サイクル(131ms)
	IWDT.IWDTCR.BIT.CKS			= 0;		//分周なし
	IWDT.IWDTCR.BIT.RPES		= 3;		//ウィンドウ終了位置75%
	IWDT.IWDTCR.BIT.RPSS		= 3;		//ウィンドウ開始位置25%
	IWDT.IWDTRCR.BIT.RSTIRQS	= 1;		//リセット出力を許可
	IWDT.IWDTSR.BIT.REFEF		= 0;		// IWDTSR リフレッシュエラーフラグ　クリア
	IWDT.IWDTSR.BIT.UNDFF		= 0;		// IWDTSR アンダーフローフラグ　クリア
	SYSTEM.ILOCOCR.BIT.ILCSTP	= 0;		// 0 IWDTオンチップオシレータ動作
	IWDT.IWDTRR					= 0x00;
	IWDT.IWDTRR					= 0xFF;		//ウォッチドッグタイマリセット
}

//*****************************************************************************
/// 独立ウォッチドッグタイマリセット関数
//*****************************************************************************

void reset_iwdt( void ){
	IWDT.IWDTRR				= 0x00;
	IWDT.IWDTRR				= 0xFF;
}

